sercankuslu/astromonty/trunk/Programms/dsPIC33/Microchip/TCPIP Stack/SPIRTCSRAM.c
/*********************************************************************
 *
 *  SPI RTC/SRAM Memory Driver
 *  - Tested with Maxim DS3234S
 *
 *********************************************************************
 * FileName:        SPIRTCSRAM.c
 * Dependencies:    SPIRTCSRAM.h
 * Processor:       PIC18, PIC24F, PIC24H, dsPIC30F, dsPIC33F, PIC32
 * Compiler:        Microchip C32 v1.11b or higher
 *					Microchip C30 v3.23 or higher
 *					Microchip C18 v3.30 or higher
 *					HI-TECH PICC-18 PRO 9.63PL2 or higher
 * Company:         
 *
 *
 * Author               		Date    Comment
 *~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * D.Mosh              		   02/08/11 Original 
 ********************************************************************/
#define __SPIRTCSRAM_C

#include "HardwareProfile.h"

#if defined(SPIRTCSRAM_CS_TRIS)

#include "TCPIPConfig.h"
#include "TCPIP Stack/TCPIP.h"
#include "TCPIP Stack/SPIRTCSRAM.h"


#define WRITEMASK				0x80
#define RTC_SECONDS				0x00
#define RTC_MINUTES				0x01
#define RTC_HOUR				0x02
#define RTC_DAY					0x03 	//ƒень недели
#define RTC_DATE				0x04	//день мес€ца
#define RTC_MONTH				0x05	//мес€ц + ¬ек
#define RTC_YEAR				0x06
#define RTC_SECONDS_ALARM1		0x07
#define RTC_MINUTES_ALARM1		0x08
#define RTC_HOUR_ALARM1			0x09
#define RTC_DAY_ALARM1			0x0A 	//ƒень недели
#define RTC_MINUTES_ALARM2		0x0B
#define RTC_HOUR_ALARM2			0x0C
#define RTC_DAY_ALARM2			0x0D	 	//ƒень недели
#define RTC_CONTROL				0x0E
#define RTC_STATUS				0x0F
#define RTC_CRYSTAL_AGGING		0x10
#define RTC_TEMP_MSB			0x11
#define RTC_TEMP_LSB			0x12
#define RTC_TEMP_CONTROL		0x13
#define SRAM_ADDRES				0x18
#define SRAM_DATA				0x19

#define SEC_IN_365_DAY 31536000
#define SEC_IN_366_DAY 31622400
#define SEC_1970_2000 978307200
#define SEC_IN_4_YEAR 126230400
#define SEC_IN_31DAY    2678400
#define SEC_IN_30DAY    2592000
#define SEC_IN_29DAY    2505600
#define SEC_IN_28DAY    2419200
#define SEC_IN_WEEK      604800
#define SEC_IN_DAY        86400
#define SEC_IN_HOUR        3600
  

// 1 €нвар€ 2000 года, суббота


#if defined(__PIC24F__) || defined(__PIC24FK__)
    #define RTC_PROPER_SPICON1  (0x001B | 0x0120)   // 1:1 primary prescale, 2:1 secondary prescale, CKE=1, MASTER mode
#elif defined(__dsPIC33F__) || defined(__PIC24H__)
    #define RTC_PROPER_SPICON1  (0x0016 | 0x0020)   // 4:1 primary prescale, 3:1 secondary prescale, CKE=1, MASTER mode
#elif defined(__dsPIC30F__)
    #define RTC_PROPER_SPICON1  (0x0017 | 0x0120)   // 1:1 primary prescale, 3:1 secondary prescale, CKE=1, MASTER mode
#elif defined(__PIC32MX__)
    #define RTC_PROPER_SPICON1  (_SPI2CON_ON_MASK | _SPI2CON_FRZ_MASK | _SPI2CON_CKE_MASK | _SPI2CON_MSTEN_MASK)
#else
    #define RTC_PROPER_SPICON1  (0x20)              // SSPEN bit is set, SPI in master mode, FOSC/4, IDLE state is low level
#endif

// Maximum speed of SPI Flash part in Hz
// Should theoretically operate at 25MHz, but need to account for level-shifting delays
#define SPIRTCSRAM_MAX_SPI_FREQ       (16000000ul)

#if defined (__18CXX)
    #define ClearSPIDoneFlag()  {SPIRTCSRAM_SPI_IF = 0;}
    #define WaitForDataByte()   {while(!SPIRTCSRAM_SPI_IF); SPIRTCSRAM_SPI_IF = 0;}
    #define SPI_ON_BIT          (SPIRTCSRAM_SPICON1bits.SSPEN)
#elif defined(__C30__)
    #define ClearSPIDoneFlag()
    static inline __attribute__((__always_inline__)) void WaitForDataByte( void )
    {
        while ((SPIRTCSRAM_SPISTATbits.SPITBF == 1) || (SPIRTCSRAM_SPISTATbits.SPIRBF == 0));
    }

    #define SPI_ON_BIT          (SPIRTCSRAM_SPISTATbits.SPIEN)
#elif defined( __PIC32MX__ )
    #define ClearSPIDoneFlag()
    static inline __attribute__((__always_inline__)) void WaitForDataByte( void )
    {
        while (!SPIRTCSRAM_SPISTATbits.SPITBE || !SPIRTCSRAM_SPISTATbits.SPIRBF);
    }

    #define SPI_ON_BIT          (SPIRTCSRAM_SPICON1bits.ON)
#else
    #error Determine SPI flag mechanism
#endif

// Internal pointer to address being written
static DWORD dwWriteAddr;

// Seconds value obtained by last update
static DWORD dwRTCSeconds = 0;

// Tick count of last update
static DWORD dwRTCLastUpdateTick = 0;
// Time Struct
static volatile RTC_TIME Time;

static BYTE bIsRTCTimeValid = 0;

static void _WaitWhileBusy(void);
static void spi_write(BYTE x);
static BYTE spi_read(void);
static void SPIRTCWriteReg(BYTE Reg, BYTE Data);
static BYTE SPIRTCReadReg(BYTE Reg);


//static void _GetStatus(void);
static void Wait400ns()
{
    BYTE i;
    for(i=0;i<8;i++){Nop();}
}

static void WriteAddressReg(BYTE Addr)
{
    volatile BYTE Dummy;
    SPIRTCSRAM_CS_IO = 0;    
    Dummy = SRAM_ADDRES | WRITEMASK;
    spi_write(Dummy);
    spi_write(Addr);
    SPIRTCSRAM_CS_IO = 1;    
    Wait400ns();
}

static void spi_write(BYTE x){
    volatile BYTE Dummy;
    SPIRTCSRAM_SSPBUF = x;
    WaitForDataByte();
    Dummy = SPIRTCSRAM_SSPBUF;    
}


static BYTE spi_read(void){
    BYTE dat;
    SPIRTCSRAM_SSPBUF = 0x00;
    WaitForDataByte();
    dat = SPIRTCSRAM_SSPBUF;    
    return(dat);
}        

static void _WaitWhileBusy(void){
    BYTE x;   
    do {    
        Wait400ns();
        SPIRTCSRAM_CS_IO = 0;
        spi_write(0x0f);    //control/status register
        x = spi_read();
        SPIRTCSRAM_CS_IO = 1;
        x = (x & 0x04) >> 2;        
    } while(x);
}

/*****************************************************************************
  Function:
    void SPIRTCSRAMInit(void)

  Description:
    Initializes SPI Flash module.

  Precondition:
    None

  Parameters:
    None

  Returns:
    None

  Remarks:
    This function is only called once during the lifetime of the application.

  Internal:
    This function sends WRDI to clear any pending write operation, and also
    clears the software write-protect on all memory locations.
  ***************************************************************************/
void SPIRTCSRAMInit(void)
{
	//BYTE i;
	//BYTE seconds;
	//BYTE minutes;
    //BYTE hours;
    BYTE temp_h;
    BYTE temp_l;
    //BYTE Data;
    //BYTE Address;
    volatile BYTE Dummy;
    BYTE vSPIONSave;
    #if defined(__18CXX)
    BYTE SPICON1Save;
    #elif defined(__C30__)
    WORD SPICON1Save;
    #else
    DWORD SPICON1Save;
    #endif
    
    
