sercankuslu/astromonty/trunk/Programms/dsPIC33/Microchip/TCPIP Stack/SPIRTCSRAM.c
    SPIRTCSRAM_CS_IO = 1;
    SPIRTCSRAM_CS_TRIS = 0;   // Drive SPI Flash chip select pin

    SPIRTCSRAM_SCK_TRIS = 0;  // Set SCK pin as an output
    SPIRTCSRAM_SDI_TRIS = 1;  // Make sure SDI pin is an input
    SPIRTCSRAM_SDO_TRIS = 0;  // Set SDO pin as an output

    // Save SPI state (clock speed)
    SPICON1Save = SPIRTCSRAM_SPICON1;
    vSPIONSave = SPI_ON_BIT;

    // Configure SPI
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = RTC_PROPER_SPICON1;
    SPI_ON_BIT = 1;

    ClearSPIDoneFlag();
    #if defined(__C30__)
        SPIRTCSRAM_SPICON2 = 0;
        SPIRTCSRAM_SPISTAT = 0;    // clear SPI
        SPIRTCSRAM_SPISTATbits.SPIEN = 1;
    #elif defined(__C32__)
        SPIRTCSRAM_SPIBRG = (GetPeripheralClock()-1ul)/2ul/SPIRTCSRAM_MAX_SPI_FREQ;
    #elif defined(__18CXX)
        SPIRTCSRAM_SPISTATbits.CKE = 1;       // Transmit data on rising edge of clock
        SPIRTCSRAM_SPISTATbits.SMP = 0;       // Input sampled at middle of data output time
    #endif

    SPIRTCSRAM_CS_IO = 0;
    ClearSPIDoneFlag();
                   
    GetTimeFromRTC();   
      
    _WaitWhileBusy();         //check busy flag till clear        
    Dummy = SPIRTCReadReg(RTC_CONTROL);
    Wait400ns();
    Dummy = SPIRTCReadReg(RTC_STATUS);
    Wait400ns();
    SPIRTCWriteReg(RTC_CONTROL, 0x40);            
    //interrupt every second
    SPIRTCSetAlarm1PerSec();
    TRISAbits.TRISA13 = 1;
    INTCON2bits.INT2EP = 1; //1 = Interrupt on negative edge; 0 = Interrupt on positive edge
    IPC7bits.INT2IP = 7; //111 = Interrupt is priority 7 (highest priority interrupt)
    IEC1bits.INT2IE = 1; //1 = Interrupt request enabled
    SPIRTCWriteReg(RTC_STATUS, 0x08);           
    
    SPIRTCSRAM_CS_IO = 1;   
    // Restore SPI state
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = SPICON1Save;
    SPI_ON_BIT = vSPIONSave;
}


/*****************************************************************************
  Function:
    void SPIRTCSRAMReadArray(DWORD dwAddress, BYTE *vData, WORD wLength)

  Description:
    Reads an array of bytes from the SPI Flash module.

  Precondition:
    SPIRTCSRAMInit has been called, and the chip is not busy (should be
    handled elsewhere automatically.)

  Parameters:
    dwAddress - Address from which to read
    vData - Where to store data that has been read
    wLength - Length of data to read

  Returns:
    None
  ***************************************************************************/
void SPISRAMReadArray(DWORD dwAddress, BYTE *vData, WORD wLength)
{
    
    volatile BYTE Dummy;
    BYTE vSPIONSave;
    #if defined(__18CXX)
    BYTE SPICON1Save;
    #elif defined(__C30__)
    WORD SPICON1Save;
    #else
    DWORD SPICON1Save;
    #endif
    //BYTE i;

    // Ignore operations when the destination is NULL or nothing to read
    if(vData == NULL || wLength == 0)
        return;

    // Save SPI state (clock speed)
    SPICON1Save = SPIRTCSRAM_SPICON1;
    vSPIONSave = SPI_ON_BIT;

    // Configure SPI
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = RTC_PROPER_SPICON1;
    SPI_ON_BIT = 1;

    // Activate chip select
    SPIRTCSRAM_CS_IO = 0;
    ClearSPIDoneFlag();
    
    
    // Send address
    Dummy = ((BYTE*)&dwAddress)[0];
    WriteAddressReg(Dummy);

    SPIRTCSRAM_CS_IO = 0;
    spi_write(SRAM_DATA);
    // Read data
    while(wLength--)
    {        
        Dummy = spi_read();
        *vData++ = Dummy;
    }

    // Deactivate chip select
    SPIRTCSRAM_CS_IO = 1;

    // Restore SPI state
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = SPICON1Save;
    SPI_ON_BIT = vSPIONSave;
}

/*****************************************************************************
  Function:
    void SPIRTCSRAMBeginWrite(DWORD dwAddr)

  Summary:
    Prepares the SPI SRAM module for writing.

  Description:
    Prepares the SPI SRAM module for writing.  Subsequent calls to
    SPIRTCSRAMWrite or SPIRTCSRAMWriteArray will begin at this location and
    continue sequentially.

    SPI Flash

  Precondition:
    SPIRTCSRAMInit has been called.

  Parameters:
    dwAddr - Address where the writing will begin

  Returns:
    None  
  ***************************************************************************/
void SPISRAMBeginWrite(DWORD dwAddr)
{
    dwWriteAddr = dwAddr;
}

/*****************************************************************************
  Function:
    void SPIRTCSRAMWrite(BYTE vData)

  Summary:
    Writes a byte to the SPI SRAM part.

  Description:
    This function writes a byte to the SPI SRAM part.  

  Precondition:
    SPIRTCSRAMInit and SPIRTCSRAMBeginWrite have been called

  Parameters:
    vData - The byte to write to the next memory location.

  Returns:
    None

  Remarks:    
  ***************************************************************************/
void SPISRAMWrite(BYTE vData)
{
    //BYTE i;
    volatile BYTE Dummy;
    BYTE vSPIONSave;
    #if defined(__18CXX)
    BYTE SPICON1Save;
    #elif defined(__C30__)
    WORD SPICON1Save;
    #else
    DWORD SPICON1Save;
    #endif

    // Save SPI state (clock speed)
    SPICON1Save = SPIRTCSRAM_SPICON1;
    vSPIONSave = SPI_ON_BIT;

    // Configure SPI
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = RTC_PROPER_SPICON1;
    SPI_ON_BIT = 1;

    
    // Activate the chip select
    SPIRTCSRAM_CS_IO = 0;
    ClearSPIDoneFlag();

    
    // Send address
    Dummy = ((BYTE*)&dwWriteAddr)[0];
    WriteAddressReg(Dummy);       
    
    SPIRTCSRAM_CS_IO = 0;
    Dummy = SRAM_DATA | WRITEMASK;
    spi_write(Dummy);
    spi_write(vData);
    dwWriteAddr++;

    // Deactivate chip select and wait for write to complete
    SPIRTCSRAM_CS_IO = 1;
    
    // Restore SPI state
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = SPICON1Save;
    SPI_ON_BIT = vSPIONSave;
}

/*****************************************************************************
  Function:
    void SPIRTCSRAMWriteArray(BYTE* vData, WORD wLen)

  Summary:
    Writes an array of bytes to the SPI Flash part.

  Description:
    This function writes an array of bytes to the SPI SRAM part. 

  Precondition:
    SPIRTCSRAMInit and SPIRTCSRAMBeginWrite have been called.

  Parameters:
    vData - The array to write to the next memory location
    wLen - The length of the data to be written

  Returns:
    None

