sercankuslu/astromonty/trunk/Programms/dsPIC33/Microchip/TCPIP Stack/SPIRTCSRAM.c
  Remarks:
    See Remarks in SPIRTCSRAMBeginWrite for important information about Flash
    memory parts.
  ***************************************************************************/
void SPISRAMWriteArray(BYTE* vData, WORD wLen)
{
    volatile BYTE Dummy;
    BYTE vSPIONSave;
    #if defined(__18CXX)
    BYTE SPICON1Save;
    #elif defined(__C30__)
    WORD SPICON1Save;
    #else
    DWORD SPICON1Save;
    #endif
    BOOL isStarted;    
    //BYTE i;

	// Do nothing if no data to process
	if(wLen == 0u)
		return;

    // Save SPI state (clock speed)
    SPICON1Save = SPIRTCSRAM_SPICON1;
    vSPIONSave = SPI_ON_BIT;

    // Configure SPI
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = RTC_PROPER_SPICON1;
    SPI_ON_BIT = 1;
 
    isStarted = FALSE;

    // Loop over all remaining WORDs
    while(wLen > 0)
    {
                      
        if(!isStarted)
        {
            // Activate the chip select
            SPIRTCSRAM_CS_IO = 0;
            ClearSPIDoneFlag();

            // Send address
            Dummy = ((BYTE*)&dwWriteAddr)[0];
            WriteAddressReg(Dummy);       
            
            SPIRTCSRAM_CS_IO = 0;
            Dummy = SRAM_DATA | WRITEMASK;
            spi_write(Dummy);  
            isStarted = TRUE;
        }
        Dummy = *vData++;
        spi_write(Dummy);
        dwWriteAddr++;
        wLen--;
    }   
    SPIRTCSRAM_CS_IO = 1; 
    
    // Restore SPI state
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = SPICON1Save;
    SPI_ON_BIT = vSPIONSave;
}

/*****************************************************************************
  Function:
    void SPIRTCWriteTime(void)

  Summary:
    Writes Time to the SPI RTC part.

  Description:
    This function writes Time to the SPI SRAM part. 

  Precondition:
    SPIRTCSRAMInit have been called.

  Parameters:
    None
    
  Returns:
    None

  Remarks:
    
  ***************************************************************************/

void SPIRTCWriteTime(void)
{
    BYTE vSPIONSave;
    #if defined(__18CXX)
    BYTE SPICON1Save;
    #elif defined(__C30__)
    WORD SPICON1Save;
    #else
    DWORD SPICON1Save;
    #endif       
    

    // Save SPI state (clock speed)
    SPICON1Save = SPIRTCSRAM_SPICON1;
    vSPIONSave = SPI_ON_BIT;

    // Configure SPI
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = RTC_PROPER_SPICON1;
    SPI_ON_BIT = 1;
     
    // Activate chip select
    SPIRTCSRAM_CS_IO = 0;
    ClearSPIDoneFlag();
    spi_write(RTC_SECONDS| WRITEMASK);
    spi_write(Time.b0.Val);
    spi_write(Time.b1.Val);
    spi_write(Time.b2.Val);
    spi_write(Time.b3.Val);
    spi_write(Time.b4.Val);
    spi_write(Time.b5.Val);
    spi_write(Time.b6.Val);
    SPIRTCSRAM_CS_IO = 1;
    // Restore SPI state
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = SPICON1Save;
    SPI_ON_BIT = vSPIONSave;
}
/*****************************************************************************
  Function:
    void SPIRTCReadTime(void)

  Summary:
    Read Time to the SPI RTC part.

  Description:
    Read Time to the SPI RTC part.

  Precondition:
    SPIRTCSRAMInit have been called.

  Parameters:
    
  Returns:
    None

  Remarks:
   
  ***************************************************************************/
void SPIRTCReadTime()
{     
    BYTE vSPIONSave;
    #if defined(__18CXX)
    BYTE SPICON1Save;
    #elif defined(__C30__)
    WORD SPICON1Save;
    #else
    DWORD SPICON1Save;
    #endif     
   
    BYTE seconds = 0;

    // Save SPI state (clock speed)
    SPICON1Save = SPIRTCSRAM_SPICON1;
    vSPIONSave = SPI_ON_BIT;

    // Configure SPI
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = RTC_PROPER_SPICON1;
    SPI_ON_BIT = 1;
     
    // Activate chip select
    SPIRTCSRAM_CS_IO = 0;
    ClearSPIDoneFlag();
    while(1){
        dwRTCLastUpdateTick = TickGet();
        SPIRTCSRAM_CS_IO = 0;
        spi_write(RTC_SECONDS);
        Time.b0.Val = spi_read();
        Time.b1.Val = spi_read();
        Time.b2.Val = spi_read();
        Time.b3.Val = spi_read();
        Time.b4.Val = spi_read();
        Time.b5.Val = spi_read();
        Time.b6.Val = spi_read();
        SPIRTCSRAM_CS_IO = 1; 
        Wait400ns();
        SPIRTCSRAM_CS_IO = 0;
        spi_write(RTC_SECONDS);
        seconds = spi_read();
        SPIRTCSRAM_CS_IO = 1;  
        if(Time.b0.Val == seconds){
            break;
        }
    }       
    
    // Restore SPI state
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = SPICON1Save;
    SPI_ON_BIT = vSPIONSave;
}
/*****************************************************************************
  Function:
	DWORD RTCGetUTCSeconds(void)

  Summary:
	Obtains the current time from the RTC module.

  Description:
	This function obtains the current time as reported by the SNTP module.  
	Use this value for absolute time stamping.  The value returned is (by
	default) the number of seconds since 01-Jan-1970 00:00:00.

  Precondition:
	None

  Parameters:
	None

  Returns:
  	The number of seconds since the Epoch.  (Default 01-Jan-1970 00:00:00)
  	
  Remarks:
	Do not use this function for time difference measurements.  The Tick
	module is more appropriate for those requirements.
  ***************************************************************************/
DWORD RTCGetUTCSeconds(void)
{
    DWORD dwTickDelta;
	DWORD dwTick;
    
    // Update the dwRTCSeconds variable with the number of seconds 
	// that has elapsed
	dwTick = TickGet();
	dwTickDelta = dwTick - dwRTCLastUpdateTick;
	while(dwTickDelta > TICK_SECOND)
	{
		dwRTCSeconds++;
		dwTickDelta -= TICK_SECOND;
	}	
	// Save the tick and residual fractional seconds for the next call
	dwRTCLastUpdateTick = dwTick - dwTickDelta;
    return dwRTCSeconds;
}    
/*****************************************************************************
  Function:
    DWORD GetTimeFromRTC(void)

  Summary:
    Return RTC local Time in seconds. 

  Description:    

  Precondition:
    SPIRTCSRAMInit have been called.

  Parameters:
  
  Returns:
    The number of seconds since the Epoch.  (Default 01-Jan-1970 00:00:00)

