sercankuslu/astromonty/trunk/Programms/dsPIC33/Microchip/TCPIP Stack/SPIRTCSRAM.c
  Remarks:   
  ***************************************************************************/
DWORD GetTimeFromRTC()
{
    BYTE Y;
    BYTE M;
    BYTE D;
    BYTE h;
    BYTE m;
    BYTE s;
    BYTE i;
    DWORD DY = 0;
    DWORD DM = 0;   

    SPIRTCReadTime();
        
    Y = Time.b5.month.Century * 100 + Time.b6.years.Year10   * 10 + Time.b6.years.Year;
    M = Time.b5.month.Month10  * 10 + Time.b5.month.Month;
    D = Time.b4.date.Date10    * 10 + Time.b4.date.Date;
    h = Time.b2.hours.Hour10   * 10 + Time.b2.hours.Hour;
    m = Time.b1.minutes.Min10  * 10 + Time.b1.minutes.Min;
    s = Time.b0.seconds.Sec10  * 10 + Time.b0.seconds.Sec;
    
    for(i = 1;i<M;i++){
        switch (i){        
            case 4:case 6: case 9: case 11: 
                DM += 30;
            break;
            case 2:
                DM += 28;
                if((Y % 4) == 0){
                    DM++;                    
                }
            break;
            default:
            DM += 31;        
        }
    }
    for(i=70;i < Y;i++){        
		if((i & 0x03) == 0){
            DY+=366;                    
        } else {
            DY+=365;
        }
    }   
    DY = DY + DM + D - 1;
    dwRTCSeconds = ((DY * 24 + h) * 60 + m)*60 + s;
    dwRTCLastUpdateTick = TickGet();
    return dwRTCSeconds;
}
/*****************************************************************************
  Function:
    void SetTimeFromUTC(DWORD Seconds)

  Summary:
    
  Description:
    
  Precondition:
    SPIRTCSRAMInit have been called.

  Parameters:
    
  Returns:
    None

  Remarks:
 ***************************************************************************/
void SetTimeFromUTC(DWORD Seconds)
{
    BYTE Y = 70;
    DWORD DY;
    BYTE M = 1;
    BYTE D = 1;
    BYTE d = 1;//день недели
    BYTE h = 0;
    BYTE m = 0;
    BYTE s = 0;
    DWORD DM = 31;     
    double s1; 
    DWORD dd;
    volatile DWORD Days;  
    dwRTCSeconds = Seconds;
    dwRTCLastUpdateTick = TickGet();
    Days = Seconds/86400;
    Seconds -= (DWORD)Days*86400;
    s1 = Days/7;
    dd = s1;
    d = (Days - dd*7) + 5;
    while(d>=7){d-=7;}
    
    dd  = Days/1461;
    Days -= (dd * 1461); //
    Y = dd*4 + 70;
    DY = 365; //1970
    while(Days >= DY){
        if((Y & 0x03) == 0){
            DY = 366; //366 дней           
        } else {
            DY = 365; //365 дней
        }        
        Y++;
        Days -= DY;           
    }   
    M = 1;
    while(Days>=DM){        
        switch (M){        
            case 4:case 6: case 9: case 11: 
                DM = 30;
            break;
            case 2:
                DM = 28;
                if((Y & 0x03) == 0){
                    DM = 29;                    
                }
            break;
            default:
            DM = 31;        
        }
        Days -= DM;       
        M++;
    }   
    D = Days + 1;
    
    s1 = Seconds / 3600;
    h = s1;
    Seconds -= (DWORD)h * 3600;
    
    s1 = Seconds / 60;
    m = s1;
    Seconds -= (DWORD)m * 60;
       
    s = Seconds;    
   
    Time.b0.seconds.Sec10 = s/10;
    Time.b0.seconds.Sec = s - Time.b0.seconds.Sec10*10;
    Time.b1.minutes.Min10 = m/10;
    Time.b1.minutes.Min = m - Time.b1.minutes.Min10*10;
    Time.b2.hours.Hour10  = h/10;
    Time.b2.hours.Hour  = h - Time.b2.hours.Hour10*10;
    Time.b3.day.Day       = d;
    Time.b4.date.Date10   = D/10;
    Time.b4.date.Date   = D - Time.b4.date.Date10*10;
    Time.b5.month.Month10 = M/10;
    Time.b5.month.Month = M - Time.b5.month.Month10*10;
    Time.b5.month.Century = Y/100;
    Y-= Time.b5.month.Century*100;
    Time.b6.years.Year10 = Y /10;
    Y-= Time.b6.years.Year10*10;
    Time.b6.years.Year = Y; 
    SPIRTCWriteTime();   
}
     
#if __C30_VERSION__ >= 300
void _ISR __attribute__((__no_auto_psv__)) _INT2Interrupt(void)
#else
void _ISR _INT2Interrupt(void)
#endif
{
	// Increment internal high tick counter
	dwRTCSeconds++;
	dwRTCLastUpdateTick = TickGet();
    SPIRTCWriteReg(RTC_CONTROL, 0x08);  
	// Reset interrupt flag
	 IFS1bits.INT2IF =  0;
	 
}

/*****************************************************************************
  Function:
    void SPIRTCSRAMWriteArray(BYTE* vData, WORD wLen)

  Summary:
    Writes an array of bytes to the SPI Flash part.

  Description:
    This function writes an array of bytes to the SPI SRAM part. 

  Precondition:
    SPIRTCSRAMInit and SPIRTCSRAMBeginWrite have been called.

  Parameters:
    vData - The array to write to the next memory location
    wLen - The length of the data to be written

  Returns:
    None

  Remarks:
    See Remarks in SPIRTCSRAMBeginWrite for important information about Flash
    memory parts.
  ***************************************************************************/
void SPIRTCSetAlarm1PerSec(void)
{
	volatile BYTE Dummy;
	BYTE vSPIONSave;
    #if defined(__18CXX)
    BYTE SPICON1Save;
    #elif defined(__C30__)
    WORD SPICON1Save;
    #else
    DWORD SPICON1Save;
    #endif     
	// Save SPI state (clock speed)
    SPICON1Save = SPIRTCSRAM_SPICON1;
    vSPIONSave = SPI_ON_BIT;

    // Configure SPI
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = RTC_PROPER_SPICON1;
    SPI_ON_BIT = 1;
     
    // Activate chip select
    SPIRTCSRAM_CS_IO = 0;
    ClearSPIDoneFlag();
        
    Dummy = RTC_SECONDS_ALARM1 | WRITEMASK;    
    spi_write(Dummy);
    spi_write(0x80);
    spi_write(0x80);
    spi_write(0x80);
    spi_write(0x80);
	SPIRTCSRAM_CS_IO = 1;
    // Restore SPI state
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = SPICON1Save;
    SPI_ON_BIT = vSPIONSave;
}
static void SPIRTCWriteReg(BYTE Reg, BYTE Data)
{
	volatile BYTE Dummy;
	BYTE vSPIONSave;
    #if defined(__18CXX)
    BYTE SPICON1Save;
    #elif defined(__C30__)
    WORD SPICON1Save;
    #else
    DWORD SPICON1Save;
    #endif     
	// Save SPI state (clock speed)
    SPICON1Save = SPIRTCSRAM_SPICON1;
    vSPIONSave = SPI_ON_BIT;

    // Configure SPI
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = RTC_PROPER_SPICON1;
    SPI_ON_BIT = 1;
     
    // Activate chip select
    SPIRTCSRAM_CS_IO = 0;
    ClearSPIDoneFlag();
        
