sercankuslu/astromonty/trunk/Programms/dsPIC33/Microchip/TCPIP Stack/SPIRTCSRAM.c
    Dummy = Reg | WRITEMASK;    
    spi_write(Dummy);
    spi_write(Data);    
	SPIRTCSRAM_CS_IO = 1;
    // Restore SPI state
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = SPICON1Save;
    SPI_ON_BIT = vSPIONSave;
}
static BYTE SPIRTCReadReg(BYTE Reg)
{
	volatile BYTE Dummy;
	BYTE vSPIONSave;
    #if defined(__18CXX)
    BYTE SPICON1Save;
    #elif defined(__C30__)
    WORD SPICON1Save;
    #else
    DWORD SPICON1Save;
    #endif     
	// Save SPI state (clock speed)
    SPICON1Save = SPIRTCSRAM_SPICON1;
    vSPIONSave = SPI_ON_BIT;

    // Configure SPI
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = RTC_PROPER_SPICON1;
    SPI_ON_BIT = 1;
     
    // Activate chip select
    SPIRTCSRAM_CS_IO = 0;
    ClearSPIDoneFlag();
        
    Dummy = Reg;    
    spi_write(Dummy);
    Dummy = spi_read();    
	SPIRTCSRAM_CS_IO = 1;
    // Restore SPI state
    SPI_ON_BIT = 0;
    SPIRTCSRAM_SPICON1 = SPICON1Save;
    SPI_ON_BIT = vSPIONSave;
    return Dummy;
}

void SetTime()
{
    Time.b5.month.Century = 1;
    Time.b6.years.Year10 = 1;    
    Time.b6.years.Year = 1;       
    Time.b5.month.Month10 = 0;
    Time.b5.month.Month = 8;
    Time.b3.day.Day = 3;
    Time.b4.date.Date10 = 0;
    Time.b4.date.Date = 3;
    Time.b2.hours.Hour10 = 1;
    Time.b2.hours.Hour = 0;
    Time.b1.minutes.Min10 = 0;
    Time.b1.minutes.Min = 4;
    Time.b0.seconds.Sec10 = 3;
    Time.b0.seconds.Sec = 6;

}

/*****************************************************************************
  Function:
    void SPIRTCSRAMWriteArray(BYTE* vData, WORD wLen)

  Summary:
    Writes an array of bytes to the SPI Flash part.

  Description:
    This function writes an array of bytes to the SPI SRAM part. 

  Precondition:
    SPIRTCSRAMInit and SPIRTCSRAMBeginWrite have been called.

  Parameters:
    vData - The array to write to the next memory location
    wLen - The length of the data to be written

  Returns:
    None

  Remarks:
    See Remarks in SPIRTCSRAMBeginWrite for important information about Flash
    memory parts.
  ***************************************************************************/
BYTE RTCIsTimeValid(void){
    return bIsRTCTimeValid;
}
//03.08.2011 14:49:36, sunday 
void RTCGetFormatTime(BYTE* time){     
     //static BYTE time[30];
     BYTE i = 0;
     SPIRTCReadTime();
     
     time[i++] = Time.b4.date.Date10 + '0';
     time[i++] = Time.b4.date.Date   + '0';
     time[i++] = '.';     
     time[i++] = Time.b5.month.Month10 + '0';
     time[i++] = Time.b5.month.Month + '0';
     time[i++] = '.';     
     if(Time.b5.month.Century == 0){
         time[i++] = '1';
         time[i++] = '9';         
     } else {
         time[i++] = '2';
         time[i++] = '0';         
     }
     time[i++] = Time.b6.years.Year10 + '0';
     time[i++] = Time.b6.years.Year   + '0';
     time[i++] = ' ';     
     time[i++] = Time.b2.hours.Hour10 + '0';
     time[i++] = Time.b2.hours.Hour   + '0';
     time[i++] = ':';     
     time[i++] = Time.b1.minutes.Min10 + '0';
     time[i++] = Time.b1.minutes.Min   + '0';
     time[i++] = ':';     
     time[i++] = Time.b0.seconds.Sec10 + '0';
     time[i++] = Time.b0.seconds.Sec   + '0';
     time[i++] = ',';     
     time[i++] = ' ';
     switch(Time.b3.day.Day){
         case 1:
            memcpy((void*)&time[i], "Sunday", 6);
            i+=6;
         break;
         case 2:
            memcpy((void*)&time[i], "Monday", 6);
            i+=6;
         break;
         case 3:
            memcpy((void*)&time[i], "Tuesday", 7);
            i+=7;
         break;
         case 4:
            memcpy(&(time[i]),      "Wednesday", 9);
            i+=9;
         break;
         case 5:
            memcpy((void*)&time[i], "Thursday", 8);
            i+=8;
         break;
         case 6:
            memcpy((void*)&time[i], "Friday", 6);
            i+=6;
         break;
         case 7:
            memcpy((void*)&time[i], "Saturday", 8);
            i+=8;
         break;
         default:
            time[i] = 0;
     }
     time[i++] = 0;     
     
}
#endif //#if defined(SPIRTCSRAM_CS_TRIS)

